{
  "backend/main.mo": "Empty Motoko actor placeholder for backend canister logic.",
  "feature_evidence.json": "Aggregates feature-to-file mappings and metadata for implemented blog UI, markdown support, theme, and ergonomics.",
  "frontend-file-summaries.txt": "Provides prewritten summaries for all major frontend components, features, and static assets.",
  "frontend/index.css": "Defines Tailwind base layers and OKLCH color variables for light/dark themes with global styling.",
  "frontend/index.html": "Minimal HTML shell that mounts the React app and loads the main entry script.",
  "frontend/public/posts/convolutional-neural-networks.md": "Markdown post introducing CNNs and outlining their architectural components.",
  "frontend/public/posts/image-segmentation-techniques.md": "Markdown post explaining semantic, instance, and panoptic segmentation along with segmentation architectures.",
  "frontend/public/posts/introduction-to-computer-vision.md": "Markdown post covering computer vision basics, image processing, and feature detection.",
  "frontend/public/posts/manifest.json": "Manifest listing blog post metadata including slugs, titles, dates, excerpts, tags, and filenames.",
  "frontend/public/posts/object-detection-methods.md": "Markdown post describing object detection tasks, outputs, and major detector families.",
  "frontend/src/App.tsx": "Sets up TanStack Router with routes for the post list and post detail pages wrapped in BlogLayout.",
  "frontend/src/components/common/NotFound.tsx": "Displays a user-friendly error message when a requested post is missing.",
  "frontend/src/components/layout/BlogHeader.tsx": "Sticky header with blog title, tagline, and an illustration asset.",
  "frontend/src/components/layout/BlogLayout.tsx": "Page layout wrapping header, main content area, and footer with styling.",
  "frontend/src/components/markdown/MarkdownRenderer.tsx": "Renders markdown securely by escaping HTML and applying custom parsing rules.",
  "frontend/src/components/posts/PostCard.tsx": "Renders a post preview card showing title, date, excerpt, tags, and a link to the full post.",
  "frontend/src/components/posts/PostSearch.tsx": "Provides a styled search input for filtering posts by text.",
  "frontend/src/features/posts/posts.staticApi.ts": "Fetches the post manifest and individual Markdown files from static endpoints.",
  "frontend/src/features/posts/posts.types.ts": "Defines TypeScript types for post metadata, manifest, and full post content.",
  "frontend/src/features/posts/usePosts.ts": "React Query hooks for loading all posts and fetching Markdown content for a specific post.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on the user's Internet Identity, invalidating queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state, providing login, logout, and identity context.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file exporting nothing, noting that no backend queries are needed.",
  "frontend/src/index.css": "Tailwind base styles plus custom color tokens and typography for the app, including markdown styling.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/PostDetailPage.tsx": "Displays a full post with title, date, tags, and rendered Markdown content.",
  "frontend/src/pages/PostListPage.tsx": "Shows a searchable list of posts with loading and empty states.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, colors, typography, and animations for the frontend.",
  "project_state.json": "JSON describing the blog project's current state, including schema version, required images, existing features, and pending feature requests. It outlines a Markdown-based computer-vision blog with a paper-textured visual theme."
}