{
  "kind": "build_request",
  "title": "Apply dark theme styling to tag chips and tag filter UI",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-13",
      "text": "Update the tagging UI to use a dark theme: tag chips on post preview cards, tag chips on the post detail page, and the tag filter bar (including the selected tag state and clear-filter button) should render with dark surfaces and readable light/off-white text while maintaining current tag click behavior and accessibility.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-4"
        ],
        "quotes": [
          "taggings should be dark theme"
        ]
      },
      "acceptanceCriteria": [
        "On the post list page, the TagFilterBar tag buttons render with a dark background and light/off-white text in both unselected and selected states, with a clear visual distinction between the two states.",
        "On the post list page, tag chips shown inside each PostCard render with a dark background and light/off-white text and remain clickable to navigate to the tag-filtered view.",
        "On the post detail page, tag chips render with a dark background and light/off-white text and remain clickable to navigate back to the post list with the tag filter applied.",
        "Tag UI elements meet basic contrast expectations (light text on dark surfaces) and retain hover/focus-visible styles for keyboard navigation."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/components/ui (compose existing shadcn components instead of editing them).",
    "Do not edit immutable hook/bootstrapping files: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx.",
    "Keep the existing tag filtering logic and shareable URL behavior unchanged."
  ],
  "nonGoals": [
    "Adding new tag management features (creating/editing tags) or changing how tags are stored/derived.",
    "Switching the entire site to dark mode; this change is limited to the tagging UI visuals."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}