{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Dark theme styling for tag chips and tag filter UI",
  "requirements": [
    {
      "id": "REQ-13",
      "summary": "Apply dark-surface, light-text styling to tag chips and the tag filter bar (including selected/clear states) while preserving existing tag navigation, URL behavior, and accessibility.",
      "acceptanceCriteria": [
        "On the post list page, the TagFilterBar tag buttons render with a dark background and light/off-white text in both unselected and selected states, with a clear visual distinction between the two states.",
        "On the post list page, tag chips shown inside each PostCard render with a dark background and light/off-white text and remain clickable to navigate to the tag-filtered view.",
        "On the post detail page, tag chips render with a dark background and light/off-white text and remain clickable to navigate back to the post list with the tag filter applied.",
        "Tag UI elements meet basic contrast expectations (light text on dark surfaces) and retain hover/focus-visible styles for keyboard navigation."
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add reusable dark-theme tag UI styles (e.g., component-layer utility classes for tag chips, tag filter buttons in unselected/selected states, and the clear-filter button), including hover and focus-visible treatments to maintain keyboard accessibility and adequate contrast. Keep changes scoped to tagging UI visuals only (do not switch the whole site to dark mode)."
        },
        {
          "path": "frontend/src/components/posts/TagFilterBar.tsx",
          "operation": "modify",
          "description": "Update TagFilterBar to compose existing shadcn-ui Button variants with additional dark-theme classes for: (1) unselected tag buttons, (2) selected tag button state, and (3) the clear-filter button. Preserve existing onClick behavior and URL/shareable search-param behavior. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/posts/PostCard.tsx",
          "operation": "modify",
          "description": "Replace the current light/accent tag chip styling (and inline color style) with the shared dark-theme tag chip classes so chips render as dark surfaces with readable light/off-white text while remaining clickable and retaining current navigation behavior."
        },
        {
          "path": "frontend/src/pages/PostDetailPage.tsx",
          "operation": "modify",
          "description": "Update post detail tag chips to use the shared dark-theme tag chip classes (dark surfaces, light/off-white text) while preserving existing click-to-navigate behavior back to the filtered post list and retaining hover/focus-visible styles for accessibility."
        }
      ]
    }
  ]
}